# Fundamentos de SQL
### Reto 1: Estructura de una tabla

Usando la base de datos tienda, muestra la descripción de las tablas articulo, puesto y venta. Por cada tipo de dato que encuentras llena la siguiente tabla, a mano.

In [2]:
%%sql
USE tienda;
SHOW tables;

 * mysql://data-09:***@data-09.bedu.org
0 rows affected.
4 rows affected.

[('articulo',), ('empleado',), ('puesto',), ('venta',)]

In [3]:
%%sql
DESCRIBE articulo;

 * mysql://data-09:***@data-09.bedu.org
5 rows affected.

[('id_articulo', 'int', 'NO', 'PRI', None, ''),
 ('nombre', 'varchar(45)', 'NO', '', None, ''),
 ('precio', 'double', 'NO', '', None, ''),
 ('iva', 'double', 'NO', '', None, ''),
 ('cantidad', 'int', 'NO', '', '0', '')]

In [4]:
%%sql 
DESCRIBE puesto;

 * mysql://data-09:***@data-09.bedu.org
3 rows affected.

[('id_puesto', 'int', 'NO', 'PRI', None, ''),
 ('nombre', 'varchar(45)', 'NO', '', None, ''),
 ('salario', 'double', 'NO', '', None, '')]

In [5]:
%%sql
DESCRIBE venta;

 * mysql://data-09:***@data-09.bedu.org
5 rows affected.

[('id_venta', 'int', 'NO', 'PRI', None, ''),
 ('id_articulo', 'int', 'NO', 'MUL', None, ''),
 ('id_empleado', 'int', 'NO', 'MUL', None, ''),
 ('clave', 'varchar(45)', 'NO', '', None, ''),
 ('fecha', 'timestamp', 'NO', '', 'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED on update CURRENT_TIMESTAMP')]

In [6]:
#!pip install tabulate
from tabulate import tabulate
tiposDatos = [['Tipo de Dato', 'Descripción'],
              ['int', 'números enteros'],
              ['varchar', 'cadenas de caracteres de longitud variable'],
              ['double', 'números con decimales'],
              ['timestamp', 'fecha y hora']]
print(tabulate(tiposDatos, headers='firstrow', tablefmt='fancy_grid'))

╒════════════════╤════════════════════════════════════════════╕
│ Tipo de Dato   │ Descripción                                │
╞════════════════╪════════════════════════════════════════════╡
│ int            │ números enteros                            │
├────────────────┼────────────────────────────────────────────┤
│ varchar        │ cadenas de caracteres de longitud variable │
├────────────────┼────────────────────────────────────────────┤
│ double         │ números con decimales                      │
├────────────────┼────────────────────────────────────────────┤
│ timestamp      │ fecha y hora                               │
╘════════════════╧════════════════════════════════════════════╛

### Reto 2: Estructura básica de una consulta
Escribir consultas que permitan responder a algunas preguntas.
1. ¿Cuál es el nombre de los empleados con el puesto 4?

In [7]:
%%sql
SELECT nombre 
    FROM empleado
    WHERE id_puesto = 4;

 * mysql://data-09:***@data-09.bedu.org
2 rows affected.

[('Norrie',), ('Maxy',)]

2. ¿Qué puestos tienen un salario mayor a $10,000?

In [8]:
%%sql
SELECT *
    FROM puesto
    WHERE salario > 10000
    LIMIT 10;

 * mysql://data-09:***@data-09.bedu.org
10 rows affected.

[(1, 'Analog Circuit Design manager', 28500.98),
 (2, 'Junior Executive', 10508.47),
 (3, 'Director of Sales', 28725.56),
 (4, 'Staff Scientist', 14965.31),
 (5, 'Desktop Support Technician', 15885.41),
 (6, 'Budget/Accounting Analyst III', 17131.23),
 (7, 'Accounting Assistant III', 29257.91),
 (8, 'Programmer Analyst II', 23223.95),
 (9, 'Nurse Practicioner', 11483.4),
 (10, 'Social Worker', 18008.12)]

3. ¿Qué articulos tienen un precio mayor a $1,000 y un iva mayor a 100?

In [9]:
%%sql
SELECT * 
    FROM articulo
    WHERE precio > 1000 AND iva > 100
    LIMIT 10;

 * mysql://data-09:***@data-09.bedu.org
10 rows affected.

[(2, 'Pasta - Angel Hair', 4391.73, 959.51, 503),
 (3, 'Soup Campbells - Tomato Bisque', 2991.35, 587.59, 604),
 (4, 'Wine - Valpolicella Masi', 2625.2, 770.1, 575),
 (5, 'Mousse - Banana Chocolate', 3701.62, 893.46, 248),
 (7, 'Nantucket - Kiwi Berry Cktl.', 5579.47, 1012.33, 527),
 (8, 'Wine - Fontanafredda Barolo', 2684.64, 327.16, 682),
 (9, 'Lotus Rootlets - Canned', 1996.46, 324.72, 636),
 (10, 'Wine - Vovray Sec Domaine Huet', 6066.99, 890.47, 397),
 (11, 'Cake - Pancake', 5271.11, 821.28, 64),
 (12, 'Chocolate Liqueur - Godet White', 1616.78, 612.63, 929)]

4. ¿Qué ventas incluyen los artículo 135 o 963 y fueron hechas por los empleados 835 o 369?

In [10]:
%%sql
SELECT * 
    FROM venta
    WHERE id_articulo IN(135,963) AND id_empleado IN(835,369);

 * mysql://data-09:***@data-09.bedu.org
2 rows affected.

[(7, 963, 369, '47335-894', datetime.datetime(2019, 6, 8, 0, 0)),
 (6, 135, 835, '0049-0032', datetime.datetime(2020, 2, 3, 15, 5, 27))]

### Reto 3: Ordenamientos y Límites
Usando la base de datos tienda, escribe una consulta que permita obtener el top 5 de puestos por salarios.

In [11]:
%%sql 
SELECT *
    FROM puesto
    ORDER BY salario DESC
    LIMIT 5;

 * mysql://data-09:***@data-09.bedu.org
5 rows affected.

[(494, 'Sales Representative', 29996.58),
 (18, 'Speech Pathologist', 29967.17),
 (487, 'Analog Circuit Design manager', 29923.95),
 (79, 'Junior Executive', 29916.06),
 (893, 'Technical Writer', 29912.53)]